SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM21/Include/mgm21_modem.h
/* Bit fields for MODEM IEN */
#define _MODEM_IEN_RESETVALUE                                0x00000000UL                            /**< Default value for MODEM_IEN                 */
#define _MODEM_IEN_MASK                                      0x0001FF07UL                            /**< Mask for MODEM_IEN                          */
#define MODEM_IEN_TXFRAMESENT                                (0x1UL << 0)                            /**< Frame sent                                  */
#define _MODEM_IEN_TXFRAMESENT_SHIFT                         0                                       /**< Shift value for MODEM_TXFRAMESENT           */
#define _MODEM_IEN_TXFRAMESENT_MASK                          0x1UL                                   /**< Bit mask for MODEM_TXFRAMESENT              */
#define _MODEM_IEN_TXFRAMESENT_DEFAULT                       0x00000000UL                            /**< Mode DEFAULT for MODEM_IEN                  */
#define MODEM_IEN_TXFRAMESENT_DEFAULT                        (_MODEM_IEN_TXFRAMESENT_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_IEN          */
#define MODEM_IEN_TXSYNCSENT                                 (0x1UL << 1)                            /**< Sync word sent                              */
#define _MODEM_IEN_TXSYNCSENT_SHIFT                          1                                       /**< Shift value for MODEM_TXSYNCSENT            */
#define _MODEM_IEN_TXSYNCSENT_MASK                           0x2UL                                   /**< Bit mask for MODEM_TXSYNCSENT               */
#define _MODEM_IEN_TXSYNCSENT_DEFAULT                        0x00000000UL                            /**< Mode DEFAULT for MODEM_IEN                  */
#define MODEM_IEN_TXSYNCSENT_DEFAULT                         (_MODEM_IEN_TXSYNCSENT_DEFAULT << 1)    /**< Shifted mode DEFAULT for MODEM_IEN          */
#define MODEM_IEN_TXPRESENT                                  (0x1UL << 2)                            /**< Preamble sent                               */
#define _MODEM_IEN_TXPRESENT_SHIFT                           2                                       /**< Shift value for MODEM_TXPRESENT             */
#define _MODEM_IEN_TXPRESENT_MASK                            0x4UL                                   /**< Bit mask for MODEM_TXPRESENT                */
#define _MODEM_IEN_TXPRESENT_DEFAULT                         0x00000000UL                            /**< Mode DEFAULT for MODEM_IEN                  */
#define MODEM_IEN_TXPRESENT_DEFAULT                          (_MODEM_IEN_TXPRESENT_DEFAULT << 2)     /**< Shifted mode DEFAULT for MODEM_IEN          */
#define MODEM_IEN_RXTIMDET                                   (0x1UL << 8)                            /**< Timing detected                             */
#define _MODEM_IEN_RXTIMDET_SHIFT                            8                                       /**< Shift value for MODEM_RXTIMDET              */
#define _MODEM_IEN_RXTIMDET_MASK                             0x100UL                                 /**< Bit mask for MODEM_RXTIMDET                 */
#define _MODEM_IEN_RXTIMDET_DEFAULT                          0x00000000UL                            /**< Mode DEFAULT for MODEM_IEN                  */
#define MODEM_IEN_RXTIMDET_DEFAULT                           (_MODEM_IEN_RXTIMDET_DEFAULT << 8)      /**< Shifted mode DEFAULT for MODEM_IEN          */
#define MODEM_IEN_RXPREDET                                   (0x1UL << 9)                            /**< Preamble detected                           */
#define _MODEM_IEN_RXPREDET_SHIFT                            9                                       /**< Shift value for MODEM_RXPREDET              */
#define _MODEM_IEN_RXPREDET_MASK                             0x200UL                                 /**< Bit mask for MODEM_RXPREDET                 */
#define _MODEM_IEN_RXPREDET_DEFAULT                          0x00000000UL                            /**< Mode DEFAULT for MODEM_IEN                  */
#define MODEM_IEN_RXPREDET_DEFAULT                           (_MODEM_IEN_RXPREDET_DEFAULT << 9)      /**< Shifted mode DEFAULT for MODEM_IEN          */
#define MODEM_IEN_RXFRAMEDET0                                (0x1UL << 10)                           /**< Frame with sync-word 0 detected             */
#define _MODEM_IEN_RXFRAMEDET0_SHIFT                         10                                      /**< Shift value for MODEM_RXFRAMEDET0           */
#define _MODEM_IEN_RXFRAMEDET0_MASK                          0x400UL                                 /**< Bit mask for MODEM_RXFRAMEDET0              */
#define _MODEM_IEN_RXFRAMEDET0_DEFAULT                       0x00000000UL                            /**< Mode DEFAULT for MODEM_IEN                  */
#define MODEM_IEN_RXFRAMEDET0_DEFAULT                        (_MODEM_IEN_RXFRAMEDET0_DEFAULT << 10)  /**< Shifted mode DEFAULT for MODEM_IEN          */
#define MODEM_IEN_RXFRAMEDET1                                (0x1UL << 11)                           /**< Frame with sync-word 1 detected             */
#define _MODEM_IEN_RXFRAMEDET1_SHIFT                         11                                      /**< Shift value for MODEM_RXFRAMEDET1           */
#define _MODEM_IEN_RXFRAMEDET1_MASK                          0x800UL                                 /**< Bit mask for MODEM_RXFRAMEDET1              */
#define _MODEM_IEN_RXFRAMEDET1_DEFAULT                       0x00000000UL                            /**< Mode DEFAULT for MODEM_IEN                  */
#define MODEM_IEN_RXFRAMEDET1_DEFAULT                        (_MODEM_IEN_RXFRAMEDET1_DEFAULT << 11)  /**< Shifted mode DEFAULT for MODEM_IEN          */
#define MODEM_IEN_RXTIMLOST                                  (0x1UL << 12)                           /**< Timing lost                                 */
#define _MODEM_IEN_RXTIMLOST_SHIFT                           12                                      /**< Shift value for MODEM_RXTIMLOST             */
#define _MODEM_IEN_RXTIMLOST_MASK                            0x1000UL                                /**< Bit mask for MODEM_RXTIMLOST                */
#define _MODEM_IEN_RXTIMLOST_DEFAULT                         0x00000000UL                            /**< Mode DEFAULT for MODEM_IEN                  */
#define MODEM_IEN_RXTIMLOST_DEFAULT                          (_MODEM_IEN_RXTIMLOST_DEFAULT << 12)    /**< Shifted mode DEFAULT for MODEM_IEN          */
#define MODEM_IEN_RXPRELOST                                  (0x1UL << 13)                           /**< Preamble lost                               */
#define _MODEM_IEN_RXPRELOST_SHIFT                           13                                      /**< Shift value for MODEM_RXPRELOST             */
#define _MODEM_IEN_RXPRELOST_MASK                            0x2000UL                                /**< Bit mask for MODEM_RXPRELOST                */
#define _MODEM_IEN_RXPRELOST_DEFAULT                         0x00000000UL                            /**< Mode DEFAULT for MODEM_IEN                  */
#define MODEM_IEN_RXPRELOST_DEFAULT                          (_MODEM_IEN_RXPRELOST_DEFAULT << 13)    /**< Shifted mode DEFAULT for MODEM_IEN          */
#define MODEM_IEN_RXFRAMEDETOF                               (0x1UL << 14)                           /**< Frame detection overflow                    */
#define _MODEM_IEN_RXFRAMEDETOF_SHIFT                        14                                      /**< Shift value for MODEM_RXFRAMEDETOF          */
#define _MODEM_IEN_RXFRAMEDETOF_MASK                         0x4000UL                                /**< Bit mask for MODEM_RXFRAMEDETOF             */
#define _MODEM_IEN_RXFRAMEDETOF_DEFAULT                      0x00000000UL                            /**< Mode DEFAULT for MODEM_IEN                  */
#define MODEM_IEN_RXFRAMEDETOF_DEFAULT                       (_MODEM_IEN_RXFRAMEDETOF_DEFAULT << 14) /**< Shifted mode DEFAULT for MODEM_IEN          */
#define MODEM_IEN_RXTIMNF                                    (0x1UL << 15)                           /**< Timing not found                            */
#define _MODEM_IEN_RXTIMNF_SHIFT                             15                                      /**< Shift value for MODEM_RXTIMNF               */
#define _MODEM_IEN_RXTIMNF_MASK                              0x8000UL                                /**< Bit mask for MODEM_RXTIMNF                  */
#define _MODEM_IEN_RXTIMNF_DEFAULT                           0x00000000UL                            /**< Mode DEFAULT for MODEM_IEN                  */
#define MODEM_IEN_RXTIMNF_DEFAULT                            (_MODEM_IEN_RXTIMNF_DEFAULT << 15)      /**< Shifted mode DEFAULT for MODEM_IEN          */
#define MODEM_IEN_FRCTIMOUT                                  (0x1UL << 16)                           /**< DEMOD-FRC req/ack timeout                   */
#define _MODEM_IEN_FRCTIMOUT_SHIFT                           16                                      /**< Shift value for MODEM_FRCTIMOUT             */
#define _MODEM_IEN_FRCTIMOUT_MASK                            0x10000UL                               /**< Bit mask for MODEM_FRCTIMOUT                */
#define _MODEM_IEN_FRCTIMOUT_DEFAULT                         0x00000000UL                            /**< Mode DEFAULT for MODEM_IEN                  */
#define MODEM_IEN_FRCTIMOUT_DEFAULT                          (_MODEM_IEN_FRCTIMOUT_DEFAULT << 16)    /**< Shifted mode DEFAULT for MODEM_IEN          */

/* Bit fields for MODEM CMD */
#define _MODEM_CMD_RESETVALUE                                0x00000000UL                         /**< Default value for MODEM_CMD                 */
#define _MODEM_CMD_MASK                                      0x00000039UL                         /**< Mask for MODEM_CMD                          */
#define MODEM_CMD_PRESTOP                                    (0x1UL << 0)                         /**< Preamble stop                               */
#define _MODEM_CMD_PRESTOP_SHIFT                             0                                    /**< Shift value for MODEM_PRESTOP               */
#define _MODEM_CMD_PRESTOP_MASK                              0x1UL                                /**< Bit mask for MODEM_PRESTOP                  */
#define _MODEM_CMD_PRESTOP_DEFAULT                           0x00000000UL                         /**< Mode DEFAULT for MODEM_CMD                  */
#define MODEM_CMD_PRESTOP_DEFAULT                            (_MODEM_CMD_PRESTOP_DEFAULT << 0)    /**< Shifted mode DEFAULT for MODEM_CMD          */
#define MODEM_CMD_AFCTXLOCK                                  (0x1UL << 3)                         /**< Lock AFC TX compensation                    */
#define _MODEM_CMD_AFCTXLOCK_SHIFT                           3                                    /**< Shift value for MODEM_AFCTXLOCK             */
#define _MODEM_CMD_AFCTXLOCK_MASK                            0x8UL                                /**< Bit mask for MODEM_AFCTXLOCK                */
#define _MODEM_CMD_AFCTXLOCK_DEFAULT                         0x00000000UL                         /**< Mode DEFAULT for MODEM_CMD                  */
#define MODEM_CMD_AFCTXLOCK_DEFAULT                          (_MODEM_CMD_AFCTXLOCK_DEFAULT << 3)  /**< Shifted mode DEFAULT for MODEM_CMD          */
#define MODEM_CMD_AFCTXCLEAR                                 (0x1UL << 4)                         /**< Clear AFC TX compensation.                  */
#define _MODEM_CMD_AFCTXCLEAR_SHIFT                          4                                    /**< Shift value for MODEM_AFCTXCLEAR            */
#define _MODEM_CMD_AFCTXCLEAR_MASK                           0x10UL                               /**< Bit mask for MODEM_AFCTXCLEAR               */
#define _MODEM_CMD_AFCTXCLEAR_DEFAULT                        0x00000000UL                         /**< Mode DEFAULT for MODEM_CMD                  */
#define MODEM_CMD_AFCTXCLEAR_DEFAULT                         (_MODEM_CMD_AFCTXCLEAR_DEFAULT << 4) /**< Shifted mode DEFAULT for MODEM_CMD          */
#define MODEM_CMD_AFCRXCLEAR                                 (0x1UL << 5)                         /**< Clear AFC RX compensation.                  */
#define _MODEM_CMD_AFCRXCLEAR_SHIFT                          5                                    /**< Shift value for MODEM_AFCRXCLEAR            */
#define _MODEM_CMD_AFCRXCLEAR_MASK                           0x20UL                               /**< Bit mask for MODEM_AFCRXCLEAR               */
#define _MODEM_CMD_AFCRXCLEAR_DEFAULT                        0x00000000UL                         /**< Mode DEFAULT for MODEM_CMD                  */
#define MODEM_CMD_AFCRXCLEAR_DEFAULT                         (_MODEM_CMD_AFCRXCLEAR_DEFAULT << 5) /**< Shifted mode DEFAULT for MODEM_CMD          */

